/*Направете функция която се нарича bubblesort. Функцията трябва да приема масив, който ще сортира, 
броят на елементите в масива, указател към функция (нека указателя се казва compare), 
която да указва в какъв ред да се сортира масив и указател към функция, 
която да указва как се разменят два елемента от масива (нека този указател се казва swapelements). 
Указателят compare трябва да сочи към функция, която приема два void указателя и връща int. 
Указателят swapelements, трябва да сочи, към функция, която приема два void указателя и ввръща void. 
Спомнете си, че алгоритъма ще сортира елементите в зависимост от сравнението което правите за да определите дали ще се разменят елементите.
 Ако размяната става когато първия елемент е по-голям от втория, тогава имаме възходящо сортиране. 
 Ако размяната става когато първия елемент е по-малък от втория, тогава имаме низходящо сортиране. 
 Затова в тази част може да извикаме указателя към функция compare и зависимост от резултата да определим дали да разменим елементите с 
помощта на указателя към функции swapelements.*/


#include <stdio.h>

 typedef int (*Compare)(const void * const a, const void * const b); //цялото това е равно на Compare compare
 typedef int (*Swapelements)(void * const c, void * const d); //цялото това е равно на Swapelements swapelements

/*void bubblesort(int arr[], int count, 
    int (*compare)(const void *, const void *), 
    void (*swapelements)(void *, void *)) 
{

}*/

 void bubblesort(int arr[], int count, Compare compare, Swapelements swapelements)
 {

 }

int main(){
    int arr[] = {5, 2, 9, 1, 5, 6};
    
    return 0;
}