/*Направете програма, в която дефинирайте макро - функция, която приема два аргумента (A и B) и да намира колко е резултата от (A + B) ^ 2. 
Демонстрирайте използването на това макро в main функцията. Изпълнете стъпката на препроцесинг за тази програма и качете резултата от тази стъпка в отделен файл към заданието.*/


#include <stdio.h>

#define SQUARE_SUM(A, B) ((A + B) * (A + B))

int main() {
    int a = 6;
    int b = 4;
    int result = SQUARE_SUM(a, b);

    printf("The result from (%d + %d)^2 is: %d\n", a, b, result);

    return 0;
}